Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Output of gradle hello
zh_cn: gradle hello 的输出结果

source: Output of gradle intTestClasses
zh_cn: gradle intTestClasses的输出结果

source: Output of gradle intro
zh_cn: gradle intro的输出结果

source: Output of gradle signArchives
zh_cn: gradle signArchives的输出结果

source: Output of gradle signStuffZip
zh_cn: gradle signStuffZip的输出结果

source: Output of gradle test
zh_cn: gradle test 的输出结果

source: Output of gradle transform
zh_cn: gradle transform的输出结果

source: Outputs Log Levels
zh_cn: 输出日志级别

source: Overview
zh_cn: 概述

source: Parallel execution is an incubating feature.
zh_cn: 并行执行仍是一个孵化中的功能。

source: Parallel project execution allows the separate projects in a decoupled multi-project build to be executed in parallel (see also: Section 56.9, “Decoupled Projects”).
zh_cn: 并行项目执行允许在一个解耦的多项目构建中的一些单独的项目被并行执行（参见︰第 56.9节，“解耦项目”）。

source: Parentheses are optional for method calls.
zh_cn: 调用方法时括号是可选的。

source: People can check out such a project from svn and have everything necessary to build it.
zh_cn: 人们可以从 svn 检出这样一个项目，并且具体必要的一切，来构建它。

source: Per-configuration excludes are also included in the Maven POM, if they are convertible.
zh_cn: 每一个configuration的排除规则如果可以被转换的话，也会包含在Maven POM中。

source: Performs a full build of the project and all projects it depends on.
zh_cn: 执行项目本身及它所依赖的其他所有项目的完整构建。

source: Performs a full build of the project and all projects which depend on it.
zh_cn: 执行项目本身及依赖它的其他所有项目的完整构建。

source: Performs a full build of the project.
zh_cn: 执行项目的完事构建。

source: Performs all verification tasks in the project.
zh_cn: 执行项目中所有的核查任务。

source: Performs quality checks on your project's Groovy source files using CodeNarc and generates reports from these checks.
zh_cn: 使用CodeNarc对您的项目的 Groovy 源文件执行质量检查并生成报告。

source: Performs quality checks on your project's Java source files using Checkstyle and generates reports from these checks.
zh_cn: 使用Checkstyle对您的项目的 Java 源文件执行质量检查并生成报告。

source: Performs quality checks on your project's Java source files using FindBugs and generates reports from these checks.
zh_cn: 使用FindBugs对您的项目的 Java 源文件执行质量检查并生成报告。

source: Performs quality checks on your project's Java source files using PMD and generates reports from these checks.
zh_cn: 使用PMD对您的项目的 Java 源文件执行质量检查并生成报告。

source: Performs quality checks on your project's source files using JDepend and generates reports from these checks.
zh_cn: 使用JDepend对您的项目的源文件执行质量检查并生成报告。

source: Perhaps a repository was initially misconfigured, or perhaps a "non-changing" module was published incorrectly.
zh_cn: 也许一个存储库的最初配置不正确，或许是一个“无改变”的模块被不正确地发布。

source: Periodically garbage collect the Gradle caches.
zh_cn: Gradle 缓存的定期垃圾收集。

source: Plans for future integration include:
zh_cn: 未来的集成计划包括：

source: Please be aware that the DSL and other configuration may change in later Gradle versions.
zh_cn: 请务必注意，在以后的 Gradle 版本中，相关的 DSL 和其他配置可能会有所改变。

source: Please be aware that this feature may change in later Gradle versions.
zh_cn: 请注意此功能在以后的 Gradle 版本中可能会改变。

source: Please find more information in Section 20.1, “Configuring the build environment via gradle.properties”
zh_cn: 有关更多信息请参阅20.1章节， “通过 gradle.properties 配置构建环境”

source: Please see DependencyHandler for examples and a complete reference for declaring dependencies.
zh_cn: 请参阅 DependencyHandler 的例子和声明依赖的完整参考。

source: Please try them out and give us feedback.
zh_cn: 请尝试它们，并向我们反馈。

source: Please use it and let us know how it works for you.
zh_cn: 请使用它，并且让我们知道它是帮助你的。

source: Plugin
zh_cn: 插件

source: Plugin Id
zh_cn: 插件 Id

source: Plugins add new tasks (e.g. JavaCompile), domain objects (e.g. SourceSet), conventions (e.g. main Java source is located at src/main/java) as well as extending core objects and objects from other plugins.
zh_cn: 插件添加了新任务 （例如JavaCompile），域对象 （例如SourceSet），约定（例如主要的 Java 源代码是位于src/main/java），以及扩展的核心对象和其他插件的对象。

source: Plugins advertise a short name for themselves.
zh_cn: 插件都有表示它们自己的一个短名称。.

source: Plugins are said to be applied, which is done via the Project.apply() method.
zh_cn: 插件都认为是被应用，通过Project.apply()方法来完成。

source: Plugins can pre-configure the project in smart ways to support convention-over-configuration.
zh_cn: 插件可以通过智能的方法对项目进行预配置以支持约定优于配置。

source: Potential usages of the ResolutionResult API:
zh_cn: ResolutionResult API的可能用法：

source: Pre-configure added tasks with useful defaults.
zh_cn: 使用有用的默认设置对已添加的任务进行预配置。

source: Preemptive execution of certain tasks, for example compilation.
zh_cn: 预先执行某些任务，比如编译。

source: Prerequisites
zh_cn: 系统要求

source: Presently, Gradle supports building native binaries from any combination of C++, C, Assembler, Objective-C and Objective-C++ sources.
zh_cn: 目前，Gradle 支持从C++，C，Assembler，Objective-C 和 Objective-C++源码的任意组合中构建原生二进制文件。

source: Presently, a Platform consists of a defined operating system and architecture.
zh_cn: 目前，一个Platform由一个定义的操作系统和架构构成。

source: Presently, this library dependency must be provided by your project for each TestSuiteExecutableBinary.
zh_cn: 目前，这个库依赖项必须由你的项目为每个TestSuiteExecutableBinary提供。

source: Production ANTLR grammar files.
zh_cn: 生产 ANTLR 语法文件。

source: Production Groovy sources.
zh_cn: Production Groovy 源代码。

source: Production Java source
zh_cn: 产品的Java源代码

source: Production Scala sources.
zh_cn: Production Scala 源代码。

source: Production resources
zh_cn: 产品的资源

source: Progress information messages
zh_cn: 进度信息消息

source: Project dependencies enable partial multi-project builds.
zh_cn: 项目依赖项启用了部分的多项目构建。

source: Project dependency
zh_cn: 项目依赖

source: Project in the directory where the build is executed is also configured, but only when Gradle is executed without any tasks.
zh_cn: 执行构建的所在目录的项目也会被配置，但是仅在Gradle 被执行但没有任务时。

source: Project layout
zh_cn: 项目布局

source: Project settings determine how the project is going to be analyzed.
zh_cn: Project 设置会决定这个项目将如何进行分析。

source: Project-level up-to-date checks.
zh_cn: 项目级别的 up-to-date 检查。

source: Project-specific information is configured in the sonarRunner block of the corresponding project.
zh_cn: 特定项目的信息在对应的 project 的sonarRunner块中配置。

source: Projects and tasks
zh_cn: Projects 和 tasks

source: Projects bundled as reusable libraries may have different requirements than enterprise applications integrated into much larger systems of software and infrastructure.
zh_cn: 项目捆绑作为可重用的库，比起企业应用集成到更大的软件和基础设施的系统中，可能有不同的要求。

source: Projects can also be configured individually.
zh_cn: 这些 Projects 也可以单独配置。

source: Properties and methods declared in a project are inherited to all its subprojects.
zh_cn: 定义在一个项目里的属性和方法都会被继承到它所有的子项目中。

source: Property name
zh_cn: 属性名称

source: Protocol
zh_cn: 协议

source: Provide faster feedback for execution of small projects without awaiting completion of other projects.
zh_cn: 对于一些小项目的执行，提供更快的反馈，而不必等待其他项目的完成。

source: Provide the authentication domain via the http.auth.ntlm.domain system property.
zh_cn: 通过http.auth.ntlm.domain系统属性提供验证域。

source: Provides integration with the JaCoCo code coverage library for Java.
zh_cn: 提供对 Java 的JaCoCo代码覆盖率库的集成。

source: Provides integration with the Sonar code quality platform.
zh_cn: 提供对Sonar代码质量平台的集成。

source: Publish messages to your favourite platforms, such as Twitter or Growl.
zh_cn: 将消息发布到你所喜爱的平台，如 Twitter 或 Growl。

source: Publishing artifacts
zh_cn: 发布项目

source: QUIET and higher
zh_cn: QUIET 及更高

source: Quicker feedback.
zh_cn: 更快的反馈。

source: Rather than depending on the whole configuration, a dependency on just the desired artifacts is declared.
zh_cn: 一个依赖只是声明了所需的 artifacts ，而不是依赖整个配置。

source: Re-use of configuration for unchanged projects.
zh_cn: 对于不变的项目复用配置。

source: Real-time feedback for test execution.
zh_cn: 测试执行的的实时反馈。

source: Reasonable default is used if the setting is unspecified.
zh_cn: 如果该设置未指定，将使用合理的默认值。

source: Reduce total build time for a multi-project build where execution is IO bound or otherwise does not consume all available CPU resources.
zh_cn: 通过让执行进行IO绑定，或者是其他不消耗所有可用资源的方式，减少多项目构建 的总构建时间

source: Reference name
zh_cn: 引用名称

source: Regardless of which Zinc version is used, Zinc will always use the Scala compiler found on the scalaTools configuration.
zh_cn: 无论使用哪一个 Zinc 版本，Zinc 都是使用在scalaTools配置上找到的 Scala 编译器。

source: Removes all Eclipse configuration files
zh_cn: 删除所有的 Eclipse 配置文件

source: Removes all IDEA configuration files
zh_cn: 删除所有的 IDEA 配置文件

source: Removes the .classpath file.
zh_cn: 删除.classpath文件。

source: Removes the .project file.
zh_cn: 删除.project文件。

source: Removes the .settings/org.eclipse.jdt.core.prefs file.
zh_cn: 删除.settings/org.eclipse.jdt.core.prefs文件。

source: Removes the .settings/org.eclipse.wst.common.component file.
zh_cn: 删除.settings/org.eclipse.wst.common.component文件。

source: Removes the IDEA module file
zh_cn: 删除 IDEA 模块文件

source: Removes the IDEA project file
zh_cn: 删除 IDEA 项目文件

source: Removes the IDEA workspace file
zh_cn: 删除 IDEA 工作区文件

source: Replacing tasks
zh_cn: 替换任务

source: Repositories
zh_cn: 仓库

source: Repository Manager like Artifactory or Nexus make this easier.
zh_cn: 仓库管理器，比如像 Artifactory 或 Nexus 则会使这些工作变得轻松。

source: Repository independence allows builds to be isolated from each other in an advanced way that no build tool has done before.
zh_cn: 仓库独立允许构建之间用一种先进方法的方法彼此隔离，以前没有构建工具能做到这样。

source: Requires the notify-send package to be installed.
zh_cn: 需要已安装通知发送包。

source: Resources
zh_cn: 资源

source: Resources for the given source set
zh_cn: 给定的源集的资源

source: Results in an efficient binary format.
zh_cn: 有效二进制格式的结果。

source: Return Type
zh_cn: 返回类型

source: Returns an OsgiManifest object configured by the closure.
zh_cn: 返回一个通过闭包配置的 OsgiManifest 对象。

source: Returns an OsgiManifest object.
zh_cn: 返回一个 OsgiManifest 对象。

source: Reusing and expiration of daemons
zh_cn: 重用和失效的守护程序

source: Root project is always configured.
zh_cn: 根项目始终会被配置。

source: Rules not just work when calling tasks from the command line.
zh_cn: 规则不只是从命令行调用任务才起作用。

source: Run build validations early in the build: eg.
zh_cn: 在构建中尽早进行构建验证：如，

source: Running "gradle installCustomDist" will install the distribution contents into "$buildDir/install/custom".
zh_cn: 运行”gradle installCustomDist“将会把分发内容安装到”$buildDir/install/custom“。

source: Running gradle build will compile, test and JAR your project.
zh_cn: 运行 gradle build将会对你的项目进行编译，测试和打包成jar。

source: Running gradle build will compile, test and WAR your project.
zh_cn: 运行 gradle build将会执行编译，测试和把你的项目打包为WAR包。

source: Running gradle jettyRun will run your web application in an embedded Jetty web container.
zh_cn: 运行 gradle jettyRun 将会在一个嵌入式Jetty web容器中运行您的web应用程序。

source: Running gradle jettyRunWar will build the WAR file, and then run it in an embedded web container.
zh_cn: 运行 gradle jettyRunWar会构建WAR文件，然后在一个嵌入式的web容器中运行它。

source: Running and testing your installation
zh_cn: 运行和测试您的安装

source: Running this from the consumer directory gives:
zh_cn: 从consumer目录运行如下：

source: Running your web application
zh_cn: 运行您的 web 应用程序

source: Runs Checkstyle against the given source set's Java source files.
zh_cn: 针对source set 的 Java 源文件运行 Checkstyle。

source: Runs Checkstyle against the production Java source files.
zh_cn: 针对生产Java 源文件运行 Checkstyle。

source: Runs Checkstyle against the test Java source files.
zh_cn: 针对测试 Java 源文件运行 Checkstyle。

source: Runs CodeNarc against the given source set's Groovy source files.
zh_cn: 针对给定的source set 的 Groovy 源文件运行 CodeNarc。

source: Runs CodeNarc against the production Groovy source files.
zh_cn: 针对生产 Groovy 源文件运行 CodeNarc。

source: Runs CodeNarc against the test Groovy source files.
zh_cn: 针对测试 Groovy 源文件运行 CodeNarc。

source: Runs FindBugs against the given source set's Java source files.
zh_cn: 针对source set 的 Java 源文件运行 FindBugs。

source: Runs FindBugs against the production Java source files.
zh_cn: 针对生产Java 源文件运行 FindBugs。

source: Runs FindBugs against the test Java source files.
zh_cn: 针对测试 Java 源文件运行 FindBugs。

source: Runs JDepend against the given source set's Java source files.
zh_cn: 针对source set 的 Java 源文件运行 JDepend。

source: Runs JDepend against the production Java source files.
zh_cn: 针对生产Java 源文件运行 JDepend。

source: Runs JDepend against the test Java source files.
zh_cn: 针对测试Java 源文件运行 JDepend。

source: Runs PMD against the given source set's Java source files.
zh_cn: 针对source set 的 Java 源文件运行 PMD。

source: Runs PMD against the production Java source files.
zh_cn: 针对生产Java 源文件运行 PMD。

source: Runs PMD against the test Java source files.
zh_cn: 针对测试 Java 源文件运行 PMD。

source: Runs the unit tests using JUnit or TestNG.
zh_cn: 使用 JUnit 或 TestNG运行单元测试。

source: Runtime dependencies
zh_cn: 运行时依赖

source: Runtime time dependencies for the given source set
zh_cn: 给定源集的运行时依赖

source: Say one open source library needs one version of a logging library and a another uses an alternative version.
zh_cn: 比如说一个开源库需要一个日志库的一个版本，而另一个库需要日志库的另一个版本。

source: Scala plugin - tasks
zh_cn: Scala 插件-任务

source: Scala projects need to declare a scala-library dependency.
zh_cn: Scala 项目需要声明一个scala-library依赖项。

source: Scala sources for the given source set.
zh_cn: 给定的source set 的 Scala 源代码。

source: Scalability is an important requirement for Gradle.
zh_cn: 可伸缩性是 Gradle 的一项重要要求。

source: Secondly when using parallel execution and all dependencies of a task have been satisfied apart from should run after then this task will be run regardless of weather its 'should run after' dependencies have been run or not.
zh_cn: 其次，当使用并行执行，并且一个任务的所有依赖项除了任务应该在之后运行之外所有条件已满足，那么这个任务将会运行，不管它的“应该在之后运行”的依赖项是否已经运行了。

source: Secondly, the copy() method can not honor task dependencies when a task is used as a copy source (i.e. as an argument to from()) because it's a method and not a task.
zh_cn: 第二，当一个任务用作复制源（即作为 from() 的参数）的时候，copy()方法不能建立任务依赖性，因为它是一个方法，而不是一个任务。

source: Sections of existing Eclipse files that are also the target of generated content will be amended or overwritten, depending on the particular section.
zh_cn: 已存在的Eclipse 文件的部分，也是生成的目标内容，将会被修改或覆盖，具体取决于特定的部分。

source: Sections of existing IDEA files that are also the target of generated content will be amended or overwritten, depending on the particular section.
zh_cn: 已存在的 IDEA 文件的部分，也是生成的目标内容，将会被修改或覆盖，具体取决于特定的部分。

source: See AnnouncePluginExtension.
zh_cn: 请参阅 AnnouncePluginExtension。

source: See CheckstyleExtension.
zh_cn: 请参阅CheckstyleExtension。

source: See CodeNarcExtension.
zh_cn: 请参阅CodeNarcExtension。

source: See DependencyHandler for more examples and a complete reference.
zh_cn: 有关更多的例子和完整的参考，请参阅DependencyHandler 。

source: See FindBugsExtension.
zh_cn: 请参阅FindBugsExtension。

source: See IvyArtifactRepository for details.
zh_cn: 详细信息请参阅IvyArtifactRepository 。

source: See JDependExtension.
zh_cn: 请参阅JDependExtension。

source: See PmdExtension.
zh_cn: 请参阅PmdExtension。

source: See Project.
zh_cn: 请参见 Project。

source: See Chapter 59, Organizing Build Logic for more details about the buildSrc project.
zh_cn: 有关buildSrc 项目的更详细信息，请参阅 第五十九章， 组织构建逻辑 。

source: See Section 20.1, “Configuring the build environment via gradle.properties” for how to manage memory settings for that process.
zh_cn: 有关如何管理这一进程的内存设置，请参阅第 20.1 节，“通过 gradle.properties 配置构建环境"的第 20.1 条”。

source: See Section 35.6, “Configuring Sonar Settings from the Command Line” for more information.
zh_cn: 有关更多信息，请参见第35.6节，“从命令行配置 Sonar 设置” 。

source: See Section 50.4.8, “Optional attributes”
zh_cn: 请参阅 第50.4.8 节，“可选属性”

source: See Section 50.6, “Repositories”.
zh_cn: 请参阅 50.6 节，“仓库”。

source: See Section 52.6.4.2, “Dependency mapping”.
zh_cn: 见 52.6.4.2 节，“依赖映射”。

source: See Section 56.1.1.1, “Configuration on demand”.
zh_cn: 请参阅第 56.1.1.1 节，“按需配置”。

source: See SigningExtension.setRequired() for more information.
zh_cn: 更多的信息，请参阅SigningExtension.setRequired() 。

source: See TestLoggingContainer for how to tune test logging to your preferences.
zh_cn: 请参阅TestLoggingContainer，查看如何把你的测试日志打印调整为你的偏好设置。

source: See ResolutionStrategy for details on how to explicitly choose a particular version.
zh_cn: 有关如何显式选择一个特定版本的详细信息，请参阅ResolutionStrategy 。

source: See Chapter 19, The Gradle Daemon for more details.
zh_cn: 更多详细信息，请参阅第十九章， Gradle 守护进程。

source: See Section 50.8.2.3, “Blacklisting a particular version with a replacement”.
zh_cn: 请参阅50.8.2.3 节，“黑名单替换指定版本”。

source: See also Chapter 10, Web Application Quickstart.
zh_cn: 另请参阅第 10 章， Web 应用程序快速入门。

source: See also Chapter 7, Java Quickstart.
zh_cn: 另请参阅第 7 章， Java 快速入门。

source: See also Chapter 9, Groovy Quickstart.
zh_cn: 另请参阅第9章，Groovy 快速入门。

source: See also: MavenPluginConvention
zh_cn: 请参见： MavenPluginConvention

source: See examples in DependencyHandler.
zh_cn: 请参阅DependencyHandler中的示例。

source: See examples in ResolutionStrategy
zh_cn: 请参阅ResolutionStrategy中的示例。

source: See the tool chain section below for more details.
zh_cn: 更多的细节请参阅下面的工具链部分。

source: See the next section for information on cross-compiling for other operating systems.
zh_cn: 关于其他操作系统的交叉编译的信息，可以参考下一节。

source: See their API documentation for further information.
zh_cn: 可以查阅它们的API 文档以了解更多信息。

source: SeeSection 52.6.4.1, “Multiple artifacts per project”.
zh_cn: 请参阅第 52.6.4.1 节，“一个项目多个构件”。

source: Selecting which build to execute
zh_cn: 选择执行哪个构建

source: Sends local announcements to your desktop about interesting events in the build lifecycle.
zh_cn: 在构建的生命周期中，把本地公告中有关你感兴趣的事件发送到你的桌面。

source: Separating the storage of downloaded artifacts from the cache metadata permits us to do some very powerful things with our cache that would be difficult with a transparent, file-only cache layout.
zh_cn: 从下载的构件的存储中分享出缓存的元数据，将允许我们使用缓存做一些非常有用的东西，而如果使用一个透明的只有文件的缓存布局则会很困难。

source: Set the http.proxyUser system property to a value like domain/username.
zh_cn: 将http.proxyUser系统属性设置为一个这样的值：域/用户名。

source: Setting options.fork to true causes compilation to occur in a separate process.
zh_cn: 将options.fork设置为true将会使编译出现在一个单独的进程中。

source: Setting options.useAnt to false activates Gradle's direct compiler integration, bypassing the Ant task.
zh_cn: 将options.useAnt设置为false将绕过 Ant 任务，而激活 Gradle 的直接编译器集成。

source: Setting a system property of taskName.single = testNamePattern will only execute tests that match the specified testNamePattern.
zh_cn: 设置一个 taskName.single = testNamePattern 的系统属性将会只执行匹配 testNamePattern的那些测试。

source: Setting it to false prevents the execution of any of the task's actions.
zh_cn: 将它设置为false，可以不让这个任务的任何操作执行。

source: Setting up a consistent environment for your build is as simple as placing those settings into a gradle.properties file.
zh_cn: 在你的构建当中，建立一致的环境，就和把这些配置放进 gradle.properties 文件一样简单。

source: Setup
zh_cn: 设置

source: Several objects in Gradle implement the FileTree interface, such as source sets.
zh_cn: Gradle 中的几个对象都实现了FileTree接口，例如source sets。

source: She may address the security bug successfully, but she also may have introduced subtle bugs into a codebase that was using a now-deprecated feature from Hibernate.
zh_cn: 她可能成功地解决了这个安全 bug，但她也可能有引入一些 bug 到代码库中，因为项目用到了 Hibernate 现在弃用的功能。

source: Shortcut notations
zh_cn: 简洁写法

source: Should you exclude per-dependency or per-configuration?
zh_cn: 你应排除每个依赖或每个配置吗？

source: Similarly property access and method calls within the settings file is delegated to a settings object.
zh_cn: 同样，在设置文件中的属性访问和方法调用也会委托给一个settings 对象。

source: Similarly, settings can be specified to target binaries for a component that are of a particular type: eg all shared libraries for the main library component.
zh_cn: 同样，也可以为某种特定类型的组件，把设置指向目标二进制文件：例如所有main library组件的shared libraries。

source: Simply use an SLF4J logger.
zh_cn: 只需使用一个 SLF4J 的logger对象。

source: Since 1.0-milestone-4 WTP-generating code was refactored into a separate plugin called eclipse-wtp.
zh_cn: 从 1.0-里程碑-4 开始，WTP-generating 代码被重构为一个单独的插件，叫做eclipse-wtp。

source: Since Gradle 1.2 there is also a new programmatic API to access the resolved dependency information.
zh_cn: 从 Gradle 1.2 起，有一个新的编程 API 用于访问解析的依赖信息。

source: Skipped projects will not be displayed in the Sonar web interface.
zh_cn: 跳过的项目将不会显示在 Sonar 的 web 界面中。

source: Skipping tasks
zh_cn: 跳过任务

source: Skipping tasks that are up-to-date
zh_cn: 跳过处于最新状态的任务

source: Snappy up-to-date checks: use native file system change notifications (e.g. via jdk7 nio.2) to preemptively perform up-to-date analysis.
zh_cn: 敏捷的 up-to-date 检查：使用本地文件系统修改通知（例如，通过 jdk7 nio.2）预先执行 up-to-date 分析。

source: So even if there is some idle daemon waiting for build requests but you happen to run build with a different java home then a brand new daemon will be forked.
zh_cn: 所以即使有一些闲置的守护进程等待构建请求，但你碰巧通过不同的 java HOME 运行构建，那么一个全新的守护进程将会被fork。

source: So for GCC running on linux, the supported target platforms are 'linux/x86' and 'linux/x86_64'.
zh_cn: 所以对于linux上运行的GCC，支持的目标平台是“linux/x86”和“linux/x86_64”。

source: So if a platform does not define a value for operatingSystem, Gradle will find the first available tool chain that can build for the specified architecture.
zh_cn: 所以如果一个平台没有为operatingSystem定义一个值的话，Gradle 将会找到第一个可以用来构建这个指定architecture的工具链。

source: So if you are interested in WTP integration then only apply the eclipse-wtp plugin.
zh_cn: 所以如果你对 WTP 集成有兴趣，可以只应用eclipse-wtp插件。

source: So the actual set of artifacts (typically jars) you depend on is the set of artifacts that are associated with the default configuration of that module.
zh_cn: 所以实际上，你依赖的 artifacts 集（通常是一些 jar 包） 是与该模块的 default 配置相关联的 artifacts 集。

source: So you can enter the api directory and trigger a gradle compile.
zh_cn: 所以你可以进入api目录并触发gradle compile。

source: So you can just run gradle build to build and test all projects.
zh_cn: 因此，你可以只执行gradle build 来构建和测试所有的项目。

source: So, if you're wondering what 'tags' are available in your build script, you can start with the documentation for the Project interface.
zh_cn: 所以，如果你想知道什么 '标签（tag）' 在构建脚本中可用，您可以去看项目接口的文档。

source: Software development plugins
zh_cn: 软件开发插件

source: Some Groovy basics
zh_cn: 一些 Groovy 基础

source: Some advanced, synthetic tests may not be fully compatible with filtering.
zh_cn: 一些高级的、 综合的测试可能不完全符合过滤条件。

source: Some daemon settings, such as JVM arguments, memory settings or the Java home, can be configured.
zh_cn: 可以配置一些守护进程的设置，例如 JVM 参数、 内存设置或Java home目录。

source: Some examples of using the command line option:
zh_cn: 使用命令行选项的一些示例：

source: Some of the most common configuration options are shown below.
zh_cn: 一些最常见的配置选项如下所示。

source: Some of them Gradle handles now and some will be satisfied in the future releases:
zh_cn: 以下这些场景中，有一些Gradle现在就可以处理，而有一些则将在未来得到实现：

source: Some of these patterns are outlined below.
zh_cn: 下面将概述其中的某些模式。

source: Some other types of things you can pass to files():
zh_cn: 你可以向files()传入一些其他类型的对象：

source: Some plugins add additional archive tasks to the project.
zh_cn: 某些插件还向项目添加额外的归档任务。

source: Some plugins add additional compilation tasks for the source set.
zh_cn: 某些插件还为源集添加了额外的编译任务。

source: Some plugins add additional compilation tasks.
zh_cn: 一些插件添加了额外的编译任务。

source: Some plugins add additional test compilation tasks.
zh_cn: 一些插件添加了额外的测试编译任务。

source: Some plugins add additional verification tasks to the project.
zh_cn: 某些插件还向项目添加额外的核查任务。

source: Some plugins, such as the Groovy plugin, add additional Java source files to this collection.
zh_cn: 有些插件，如Groovy 插件，会从该集合中增加其他的Java源文件。

source: Some plugins, such as the Groovy plugin, add additional source files to this collection.
zh_cn: 有些插件，如Groovy 插件，会从该集合中增加其他的源文件。

source: Some ways of troubleshooting the Gradle daemon:
zh_cn: 以下是有关 Gradle 守护进程的故障排除的一些方面：

source: Somehow Gradle has to find out, whether the project you are into, is a subproject of a multiproject build or not.
zh_cn: 由于一些不明的原因， Gradle 不得不找出，你所进入的项目，它是否为一个多项目构建中的一个子项目。

source: Somehow the dependency information has to be mapped to a path.
zh_cn: 某种程度上依赖信息必须映射到一个路径上。

source: Sometimes a repository will have the POMs published to one location, and the JARs and other artifacts published at another location.
zh_cn: 有时候，一个仓库会出现 POM 文件发布在一个地方，而 JAR 文件和其他构件发布在另一个地方。
